; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l5-t1-p12---int100n150-m25---int100c150---s258---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 level103 level104 level105 level106 level107 level108 level109 level110 level111 level112 level113 level114 level115 level116 level117 level118 level119 level120 level121 level122 level123 level124 level125 level126 level127 level128 level129 level130 level131 level132 level133 level134 level135 level136 - fuellevel
)

(:init
(sum level0 level5 level5)
(sum level0 level11 level11)
(sum level0 level17 level17)
(sum level0 level18 level18)
(sum level0 level23 level23)
(sum level0 level24 level24)
(sum level1 level5 level6)
(sum level1 level11 level12)
(sum level1 level17 level18)
(sum level1 level18 level19)
(sum level1 level23 level24)
(sum level1 level24 level25)
(sum level2 level5 level7)
(sum level2 level11 level13)
(sum level2 level17 level19)
(sum level2 level18 level20)
(sum level2 level23 level25)
(sum level2 level24 level26)
(sum level3 level5 level8)
(sum level3 level11 level14)
(sum level3 level17 level20)
(sum level3 level18 level21)
(sum level3 level23 level26)
(sum level3 level24 level27)
(sum level4 level5 level9)
(sum level4 level11 level15)
(sum level4 level17 level21)
(sum level4 level18 level22)
(sum level4 level23 level27)
(sum level4 level24 level28)
(sum level5 level5 level10)
(sum level5 level11 level16)
(sum level5 level17 level22)
(sum level5 level18 level23)
(sum level5 level23 level28)
(sum level5 level24 level29)
(sum level6 level5 level11)
(sum level6 level11 level17)
(sum level6 level17 level23)
(sum level6 level18 level24)
(sum level6 level23 level29)
(sum level6 level24 level30)
(sum level7 level5 level12)
(sum level7 level11 level18)
(sum level7 level17 level24)
(sum level7 level18 level25)
(sum level7 level23 level30)
(sum level7 level24 level31)
(sum level8 level5 level13)
(sum level8 level11 level19)
(sum level8 level17 level25)
(sum level8 level18 level26)
(sum level8 level23 level31)
(sum level8 level24 level32)
(sum level9 level5 level14)
(sum level9 level11 level20)
(sum level9 level17 level26)
(sum level9 level18 level27)
(sum level9 level23 level32)
(sum level9 level24 level33)
(sum level10 level5 level15)
(sum level10 level11 level21)
(sum level10 level17 level27)
(sum level10 level18 level28)
(sum level10 level23 level33)
(sum level10 level24 level34)
(sum level11 level5 level16)
(sum level11 level11 level22)
(sum level11 level17 level28)
(sum level11 level18 level29)
(sum level11 level23 level34)
(sum level11 level24 level35)
(sum level12 level5 level17)
(sum level12 level11 level23)
(sum level12 level17 level29)
(sum level12 level18 level30)
(sum level12 level23 level35)
(sum level12 level24 level36)
(sum level13 level5 level18)
(sum level13 level11 level24)
(sum level13 level17 level30)
(sum level13 level18 level31)
(sum level13 level23 level36)
(sum level13 level24 level37)
(sum level14 level5 level19)
(sum level14 level11 level25)
(sum level14 level17 level31)
(sum level14 level18 level32)
(sum level14 level23 level37)
(sum level14 level24 level38)
(sum level15 level5 level20)
(sum level15 level11 level26)
(sum level15 level17 level32)
(sum level15 level18 level33)
(sum level15 level23 level38)
(sum level15 level24 level39)
(sum level16 level5 level21)
(sum level16 level11 level27)
(sum level16 level17 level33)
(sum level16 level18 level34)
(sum level16 level23 level39)
(sum level16 level24 level40)
(sum level17 level5 level22)
(sum level17 level11 level28)
(sum level17 level17 level34)
(sum level17 level18 level35)
(sum level17 level23 level40)
(sum level17 level24 level41)
(sum level18 level5 level23)
(sum level18 level11 level29)
(sum level18 level17 level35)
(sum level18 level18 level36)
(sum level18 level23 level41)
(sum level18 level24 level42)
(sum level19 level5 level24)
(sum level19 level11 level30)
(sum level19 level17 level36)
(sum level19 level18 level37)
(sum level19 level23 level42)
(sum level19 level24 level43)
(sum level20 level5 level25)
(sum level20 level11 level31)
(sum level20 level17 level37)
(sum level20 level18 level38)
(sum level20 level23 level43)
(sum level20 level24 level44)
(sum level21 level5 level26)
(sum level21 level11 level32)
(sum level21 level17 level38)
(sum level21 level18 level39)
(sum level21 level23 level44)
(sum level21 level24 level45)
(sum level22 level5 level27)
(sum level22 level11 level33)
(sum level22 level17 level39)
(sum level22 level18 level40)
(sum level22 level23 level45)
(sum level22 level24 level46)
(sum level23 level5 level28)
(sum level23 level11 level34)
(sum level23 level17 level40)
(sum level23 level18 level41)
(sum level23 level23 level46)
(sum level23 level24 level47)
(sum level24 level5 level29)
(sum level24 level11 level35)
(sum level24 level17 level41)
(sum level24 level18 level42)
(sum level24 level23 level47)
(sum level24 level24 level48)
(sum level25 level5 level30)
(sum level25 level11 level36)
(sum level25 level17 level42)
(sum level25 level18 level43)
(sum level25 level23 level48)
(sum level25 level24 level49)
(sum level26 level5 level31)
(sum level26 level11 level37)
(sum level26 level17 level43)
(sum level26 level18 level44)
(sum level26 level23 level49)
(sum level26 level24 level50)
(sum level27 level5 level32)
(sum level27 level11 level38)
(sum level27 level17 level44)
(sum level27 level18 level45)
(sum level27 level23 level50)
(sum level27 level24 level51)
(sum level28 level5 level33)
(sum level28 level11 level39)
(sum level28 level17 level45)
(sum level28 level18 level46)
(sum level28 level23 level51)
(sum level28 level24 level52)
(sum level29 level5 level34)
(sum level29 level11 level40)
(sum level29 level17 level46)
(sum level29 level18 level47)
(sum level29 level23 level52)
(sum level29 level24 level53)
(sum level30 level5 level35)
(sum level30 level11 level41)
(sum level30 level17 level47)
(sum level30 level18 level48)
(sum level30 level23 level53)
(sum level30 level24 level54)
(sum level31 level5 level36)
(sum level31 level11 level42)
(sum level31 level17 level48)
(sum level31 level18 level49)
(sum level31 level23 level54)
(sum level31 level24 level55)
(sum level32 level5 level37)
(sum level32 level11 level43)
(sum level32 level17 level49)
(sum level32 level18 level50)
(sum level32 level23 level55)
(sum level32 level24 level56)
(sum level33 level5 level38)
(sum level33 level11 level44)
(sum level33 level17 level50)
(sum level33 level18 level51)
(sum level33 level23 level56)
(sum level33 level24 level57)
(sum level34 level5 level39)
(sum level34 level11 level45)
(sum level34 level17 level51)
(sum level34 level18 level52)
(sum level34 level23 level57)
(sum level34 level24 level58)
(sum level35 level5 level40)
(sum level35 level11 level46)
(sum level35 level17 level52)
(sum level35 level18 level53)
(sum level35 level23 level58)
(sum level35 level24 level59)
(sum level36 level5 level41)
(sum level36 level11 level47)
(sum level36 level17 level53)
(sum level36 level18 level54)
(sum level36 level23 level59)
(sum level36 level24 level60)
(sum level37 level5 level42)
(sum level37 level11 level48)
(sum level37 level17 level54)
(sum level37 level18 level55)
(sum level37 level23 level60)
(sum level37 level24 level61)
(sum level38 level5 level43)
(sum level38 level11 level49)
(sum level38 level17 level55)
(sum level38 level18 level56)
(sum level38 level23 level61)
(sum level38 level24 level62)
(sum level39 level5 level44)
(sum level39 level11 level50)
(sum level39 level17 level56)
(sum level39 level18 level57)
(sum level39 level23 level62)
(sum level39 level24 level63)
(sum level40 level5 level45)
(sum level40 level11 level51)
(sum level40 level17 level57)
(sum level40 level18 level58)
(sum level40 level23 level63)
(sum level40 level24 level64)
(sum level41 level5 level46)
(sum level41 level11 level52)
(sum level41 level17 level58)
(sum level41 level18 level59)
(sum level41 level23 level64)
(sum level41 level24 level65)
(sum level42 level5 level47)
(sum level42 level11 level53)
(sum level42 level17 level59)
(sum level42 level18 level60)
(sum level42 level23 level65)
(sum level42 level24 level66)
(sum level43 level5 level48)
(sum level43 level11 level54)
(sum level43 level17 level60)
(sum level43 level18 level61)
(sum level43 level23 level66)
(sum level43 level24 level67)
(sum level44 level5 level49)
(sum level44 level11 level55)
(sum level44 level17 level61)
(sum level44 level18 level62)
(sum level44 level23 level67)
(sum level44 level24 level68)
(sum level45 level5 level50)
(sum level45 level11 level56)
(sum level45 level17 level62)
(sum level45 level18 level63)
(sum level45 level23 level68)
(sum level45 level24 level69)
(sum level46 level5 level51)
(sum level46 level11 level57)
(sum level46 level17 level63)
(sum level46 level18 level64)
(sum level46 level23 level69)
(sum level46 level24 level70)
(sum level47 level5 level52)
(sum level47 level11 level58)
(sum level47 level17 level64)
(sum level47 level18 level65)
(sum level47 level23 level70)
(sum level47 level24 level71)
(sum level48 level5 level53)
(sum level48 level11 level59)
(sum level48 level17 level65)
(sum level48 level18 level66)
(sum level48 level23 level71)
(sum level48 level24 level72)
(sum level49 level5 level54)
(sum level49 level11 level60)
(sum level49 level17 level66)
(sum level49 level18 level67)
(sum level49 level23 level72)
(sum level49 level24 level73)
(sum level50 level5 level55)
(sum level50 level11 level61)
(sum level50 level17 level67)
(sum level50 level18 level68)
(sum level50 level23 level73)
(sum level50 level24 level74)
(sum level51 level5 level56)
(sum level51 level11 level62)
(sum level51 level17 level68)
(sum level51 level18 level69)
(sum level51 level23 level74)
(sum level51 level24 level75)
(sum level52 level5 level57)
(sum level52 level11 level63)
(sum level52 level17 level69)
(sum level52 level18 level70)
(sum level52 level23 level75)
(sum level52 level24 level76)
(sum level53 level5 level58)
(sum level53 level11 level64)
(sum level53 level17 level70)
(sum level53 level18 level71)
(sum level53 level23 level76)
(sum level53 level24 level77)
(sum level54 level5 level59)
(sum level54 level11 level65)
(sum level54 level17 level71)
(sum level54 level18 level72)
(sum level54 level23 level77)
(sum level54 level24 level78)
(sum level55 level5 level60)
(sum level55 level11 level66)
(sum level55 level17 level72)
(sum level55 level18 level73)
(sum level55 level23 level78)
(sum level55 level24 level79)
(sum level56 level5 level61)
(sum level56 level11 level67)
(sum level56 level17 level73)
(sum level56 level18 level74)
(sum level56 level23 level79)
(sum level56 level24 level80)
(sum level57 level5 level62)
(sum level57 level11 level68)
(sum level57 level17 level74)
(sum level57 level18 level75)
(sum level57 level23 level80)
(sum level57 level24 level81)
(sum level58 level5 level63)
(sum level58 level11 level69)
(sum level58 level17 level75)
(sum level58 level18 level76)
(sum level58 level23 level81)
(sum level58 level24 level82)
(sum level59 level5 level64)
(sum level59 level11 level70)
(sum level59 level17 level76)
(sum level59 level18 level77)
(sum level59 level23 level82)
(sum level59 level24 level83)
(sum level60 level5 level65)
(sum level60 level11 level71)
(sum level60 level17 level77)
(sum level60 level18 level78)
(sum level60 level23 level83)
(sum level60 level24 level84)
(sum level61 level5 level66)
(sum level61 level11 level72)
(sum level61 level17 level78)
(sum level61 level18 level79)
(sum level61 level23 level84)
(sum level61 level24 level85)
(sum level62 level5 level67)
(sum level62 level11 level73)
(sum level62 level17 level79)
(sum level62 level18 level80)
(sum level62 level23 level85)
(sum level62 level24 level86)
(sum level63 level5 level68)
(sum level63 level11 level74)
(sum level63 level17 level80)
(sum level63 level18 level81)
(sum level63 level23 level86)
(sum level63 level24 level87)
(sum level64 level5 level69)
(sum level64 level11 level75)
(sum level64 level17 level81)
(sum level64 level18 level82)
(sum level64 level23 level87)
(sum level64 level24 level88)
(sum level65 level5 level70)
(sum level65 level11 level76)
(sum level65 level17 level82)
(sum level65 level18 level83)
(sum level65 level23 level88)
(sum level65 level24 level89)
(sum level66 level5 level71)
(sum level66 level11 level77)
(sum level66 level17 level83)
(sum level66 level18 level84)
(sum level66 level23 level89)
(sum level66 level24 level90)
(sum level67 level5 level72)
(sum level67 level11 level78)
(sum level67 level17 level84)
(sum level67 level18 level85)
(sum level67 level23 level90)
(sum level67 level24 level91)
(sum level68 level5 level73)
(sum level68 level11 level79)
(sum level68 level17 level85)
(sum level68 level18 level86)
(sum level68 level23 level91)
(sum level68 level24 level92)
(sum level69 level5 level74)
(sum level69 level11 level80)
(sum level69 level17 level86)
(sum level69 level18 level87)
(sum level69 level23 level92)
(sum level69 level24 level93)
(sum level70 level5 level75)
(sum level70 level11 level81)
(sum level70 level17 level87)
(sum level70 level18 level88)
(sum level70 level23 level93)
(sum level70 level24 level94)
(sum level71 level5 level76)
(sum level71 level11 level82)
(sum level71 level17 level88)
(sum level71 level18 level89)
(sum level71 level23 level94)
(sum level71 level24 level95)
(sum level72 level5 level77)
(sum level72 level11 level83)
(sum level72 level17 level89)
(sum level72 level18 level90)
(sum level72 level23 level95)
(sum level72 level24 level96)
(sum level73 level5 level78)
(sum level73 level11 level84)
(sum level73 level17 level90)
(sum level73 level18 level91)
(sum level73 level23 level96)
(sum level73 level24 level97)
(sum level74 level5 level79)
(sum level74 level11 level85)
(sum level74 level17 level91)
(sum level74 level18 level92)
(sum level74 level23 level97)
(sum level74 level24 level98)
(sum level75 level5 level80)
(sum level75 level11 level86)
(sum level75 level17 level92)
(sum level75 level18 level93)
(sum level75 level23 level98)
(sum level75 level24 level99)
(sum level76 level5 level81)
(sum level76 level11 level87)
(sum level76 level17 level93)
(sum level76 level18 level94)
(sum level76 level23 level99)
(sum level76 level24 level100)
(sum level77 level5 level82)
(sum level77 level11 level88)
(sum level77 level17 level94)
(sum level77 level18 level95)
(sum level77 level23 level100)
(sum level77 level24 level101)
(sum level78 level5 level83)
(sum level78 level11 level89)
(sum level78 level17 level95)
(sum level78 level18 level96)
(sum level78 level23 level101)
(sum level78 level24 level102)
(sum level79 level5 level84)
(sum level79 level11 level90)
(sum level79 level17 level96)
(sum level79 level18 level97)
(sum level79 level23 level102)
(sum level79 level24 level103)
(sum level80 level5 level85)
(sum level80 level11 level91)
(sum level80 level17 level97)
(sum level80 level18 level98)
(sum level80 level23 level103)
(sum level80 level24 level104)
(sum level81 level5 level86)
(sum level81 level11 level92)
(sum level81 level17 level98)
(sum level81 level18 level99)
(sum level81 level23 level104)
(sum level81 level24 level105)
(sum level82 level5 level87)
(sum level82 level11 level93)
(sum level82 level17 level99)
(sum level82 level18 level100)
(sum level82 level23 level105)
(sum level82 level24 level106)
(sum level83 level5 level88)
(sum level83 level11 level94)
(sum level83 level17 level100)
(sum level83 level18 level101)
(sum level83 level23 level106)
(sum level83 level24 level107)
(sum level84 level5 level89)
(sum level84 level11 level95)
(sum level84 level17 level101)
(sum level84 level18 level102)
(sum level84 level23 level107)
(sum level84 level24 level108)
(sum level85 level5 level90)
(sum level85 level11 level96)
(sum level85 level17 level102)
(sum level85 level18 level103)
(sum level85 level23 level108)
(sum level85 level24 level109)
(sum level86 level5 level91)
(sum level86 level11 level97)
(sum level86 level17 level103)
(sum level86 level18 level104)
(sum level86 level23 level109)
(sum level86 level24 level110)
(sum level87 level5 level92)
(sum level87 level11 level98)
(sum level87 level17 level104)
(sum level87 level18 level105)
(sum level87 level23 level110)
(sum level87 level24 level111)
(sum level88 level5 level93)
(sum level88 level11 level99)
(sum level88 level17 level105)
(sum level88 level18 level106)
(sum level88 level23 level111)
(sum level88 level24 level112)
(sum level89 level5 level94)
(sum level89 level11 level100)
(sum level89 level17 level106)
(sum level89 level18 level107)
(sum level89 level23 level112)
(sum level89 level24 level113)
(sum level90 level5 level95)
(sum level90 level11 level101)
(sum level90 level17 level107)
(sum level90 level18 level108)
(sum level90 level23 level113)
(sum level90 level24 level114)
(sum level91 level5 level96)
(sum level91 level11 level102)
(sum level91 level17 level108)
(sum level91 level18 level109)
(sum level91 level23 level114)
(sum level91 level24 level115)
(sum level92 level5 level97)
(sum level92 level11 level103)
(sum level92 level17 level109)
(sum level92 level18 level110)
(sum level92 level23 level115)
(sum level92 level24 level116)
(sum level93 level5 level98)
(sum level93 level11 level104)
(sum level93 level17 level110)
(sum level93 level18 level111)
(sum level93 level23 level116)
(sum level93 level24 level117)
(sum level94 level5 level99)
(sum level94 level11 level105)
(sum level94 level17 level111)
(sum level94 level18 level112)
(sum level94 level23 level117)
(sum level94 level24 level118)
(sum level95 level5 level100)
(sum level95 level11 level106)
(sum level95 level17 level112)
(sum level95 level18 level113)
(sum level95 level23 level118)
(sum level95 level24 level119)
(sum level96 level5 level101)
(sum level96 level11 level107)
(sum level96 level17 level113)
(sum level96 level18 level114)
(sum level96 level23 level119)
(sum level96 level24 level120)
(sum level97 level5 level102)
(sum level97 level11 level108)
(sum level97 level17 level114)
(sum level97 level18 level115)
(sum level97 level23 level120)
(sum level97 level24 level121)
(sum level98 level5 level103)
(sum level98 level11 level109)
(sum level98 level17 level115)
(sum level98 level18 level116)
(sum level98 level23 level121)
(sum level98 level24 level122)
(sum level99 level5 level104)
(sum level99 level11 level110)
(sum level99 level17 level116)
(sum level99 level18 level117)
(sum level99 level23 level122)
(sum level99 level24 level123)
(sum level100 level5 level105)
(sum level100 level11 level111)
(sum level100 level17 level117)
(sum level100 level18 level118)
(sum level100 level23 level123)
(sum level100 level24 level124)
(sum level101 level5 level106)
(sum level101 level11 level112)
(sum level101 level17 level118)
(sum level101 level18 level119)
(sum level101 level23 level124)
(sum level101 level24 level125)
(sum level102 level5 level107)
(sum level102 level11 level113)
(sum level102 level17 level119)
(sum level102 level18 level120)
(sum level102 level23 level125)
(sum level102 level24 level126)
(sum level103 level5 level108)
(sum level103 level11 level114)
(sum level103 level17 level120)
(sum level103 level18 level121)
(sum level103 level23 level126)
(sum level103 level24 level127)
(sum level104 level5 level109)
(sum level104 level11 level115)
(sum level104 level17 level121)
(sum level104 level18 level122)
(sum level104 level23 level127)
(sum level104 level24 level128)
(sum level105 level5 level110)
(sum level105 level11 level116)
(sum level105 level17 level122)
(sum level105 level18 level123)
(sum level105 level23 level128)
(sum level105 level24 level129)
(sum level106 level5 level111)
(sum level106 level11 level117)
(sum level106 level17 level123)
(sum level106 level18 level124)
(sum level106 level23 level129)
(sum level106 level24 level130)
(sum level107 level5 level112)
(sum level107 level11 level118)
(sum level107 level17 level124)
(sum level107 level18 level125)
(sum level107 level23 level130)
(sum level107 level24 level131)
(sum level108 level5 level113)
(sum level108 level11 level119)
(sum level108 level17 level125)
(sum level108 level18 level126)
(sum level108 level23 level131)
(sum level108 level24 level132)
(sum level109 level5 level114)
(sum level109 level11 level120)
(sum level109 level17 level126)
(sum level109 level18 level127)
(sum level109 level23 level132)
(sum level109 level24 level133)
(sum level110 level5 level115)
(sum level110 level11 level121)
(sum level110 level17 level127)
(sum level110 level18 level128)
(sum level110 level23 level133)
(sum level110 level24 level134)
(sum level111 level5 level116)
(sum level111 level11 level122)
(sum level111 level17 level128)
(sum level111 level18 level129)
(sum level111 level23 level134)
(sum level111 level24 level135)
(sum level112 level5 level117)
(sum level112 level11 level123)
(sum level112 level17 level129)
(sum level112 level18 level130)
(sum level112 level23 level135)
(sum level112 level24 level136)
(sum level113 level5 level118)
(sum level113 level11 level124)
(sum level113 level17 level130)
(sum level113 level18 level131)
(sum level113 level23 level136)
(sum level114 level5 level119)
(sum level114 level11 level125)
(sum level114 level17 level131)
(sum level114 level18 level132)
(sum level115 level5 level120)
(sum level115 level11 level126)
(sum level115 level17 level132)
(sum level115 level18 level133)
(sum level116 level5 level121)
(sum level116 level11 level127)
(sum level116 level17 level133)
(sum level116 level18 level134)
(sum level117 level5 level122)
(sum level117 level11 level128)
(sum level117 level17 level134)
(sum level117 level18 level135)
(sum level118 level5 level123)
(sum level118 level11 level129)
(sum level118 level17 level135)
(sum level118 level18 level136)
(sum level119 level5 level124)
(sum level119 level11 level130)
(sum level119 level17 level136)
(sum level120 level5 level125)
(sum level120 level11 level131)
(sum level121 level5 level126)
(sum level121 level11 level132)
(sum level122 level5 level127)
(sum level122 level11 level133)
(sum level123 level5 level128)
(sum level123 level11 level134)
(sum level124 level5 level129)
(sum level124 level11 level135)
(sum level125 level5 level130)
(sum level125 level11 level136)
(sum level126 level5 level131)
(sum level127 level5 level132)
(sum level128 level5 level133)
(sum level129 level5 level134)
(sum level130 level5 level135)
(sum level131 level5 level136)

(connected l0 l2)
(fuelcost level18 l0 l2)
(connected l0 l3)
(fuelcost level23 l0 l3)
(connected l0 l4)
(fuelcost level18 l0 l4)
(connected l1 l2)
(fuelcost level5 l1 l2)
(connected l2 l0)
(fuelcost level18 l2 l0)
(connected l2 l1)
(fuelcost level5 l2 l1)
(connected l2 l3)
(fuelcost level17 l2 l3)
(connected l2 l4)
(fuelcost level11 l2 l4)
(connected l3 l0)
(fuelcost level23 l3 l0)
(connected l3 l2)
(fuelcost level17 l3 l2)
(connected l3 l4)
(fuelcost level24 l3 l4)
(connected l4 l0)
(fuelcost level18 l4 l0)
(connected l4 l2)
(fuelcost level11 l4 l2)
(connected l4 l3)
(fuelcost level24 l4 l3)

(at t0 l3)
(fuel t0 level136)
(= (total-cost) 0)

(at p0 l4)
(at p1 l1)
(at p2 l2)
(at p3 l3)
(at p4 l2)
(at p5 l0)
(at p6 l3)
(at p7 l4)
(at p8 l0)
(at p9 l1)
(at p10 l1)
(at p11 l0)
)

(:goal
(and
(at p0 l2)
(at p1 l0)
(at p2 l3)
(at p3 l4)
(at p4 l1)
(at p5 l3)
(at p6 l0)
(at p7 l2)
(at p8 l4)
(at p9 l0)
(at p10 l2)
(at p11 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p6 t0 l3)
   deleted: (at p6 l3)
   added: (in p6 t0)
   goals met: 0 of 12
2. (load p3 t0 l3)
   deleted: (at p3 l3)
   added: (in p3 t0)
   goals met: 0 of 12
3. (drive t0 l3 l0 level113 level23 level136)
   deleted: (at t0 l3) (fuel t0 level136)
   added: (at t0 l0) (fuel t0 level113)
   goals met: 0 of 12
4. (unload p6 t0 l0)
   deleted: (in p6 t0)
   added: (at p6 l0)
   goals met: 1 of 12
5. (load p8 t0 l0)
   deleted: (at p8 l0)
   added: (in p8 t0)
   goals met: 1 of 12
6. (load p5 t0 l0)
   deleted: (at p5 l0)
   added: (in p5 t0)
   goals met: 1 of 12
7. (load p11 t0 l0)
   deleted: (at p11 l0)
   added: (in p11 t0)
   goals met: 1 of 12
8. (drive t0 l0 l4 level95 level18 level113)
   deleted: (at t0 l0) (fuel t0 level113)
   added: (at t0 l4) (fuel t0 level95)
   goals met: 1 of 12
9. (unload p8 t0 l4)
   deleted: (in p8 t0)
   added: (at p8 l4)
   goals met: 2 of 12
10. (unload p3 t0 l4)
   deleted: (in p3 t0)
   added: (at p3 l4)
   goals met: 3 of 12
11. (load p7 t0 l4)
   deleted: (at p7 l4)
   added: (in p7 t0)
   goals met: 3 of 12
12. (load p0 t0 l4)
   deleted: (at p0 l4)
   added: (in p0 t0)
   goals met: 3 of 12
13. (drive t0 l4 l2 level84 level11 level95)
   deleted: (at t0 l4) (fuel t0 level95)
   added: (at t0 l2) (fuel t0 level84)
   goals met: 3 of 12
14. (unload p0 t0 l2)
   deleted: (in p0 t0)
   added: (at p0 l2)
   goals met: 4 of 12
15. (load p4 t0 l2)
   deleted: (at p4 l2)
   added: (in p4 t0)
   goals met: 4 of 12
16. (load p2 t0 l2)
   deleted: (at p2 l2)
   added: (in p2 t0)
   goals met: 4 of 12
17. (drive t0 l2 l1 level79 level5 level84)
   deleted: (at t0 l2) (fuel t0 level84)
   added: (at t0 l1) (fuel t0 level79)
   goals met: 4 of 12
18. (load p1 t0 l1)
   deleted: (at p1 l1)
   added: (in p1 t0)
   goals met: 4 of 12
19. (load p10 t0 l1)
   deleted: (at p10 l1)
   added: (in p10 t0)
   goals met: 4 of 12
20. (load p9 t0 l1)
   deleted: (at p9 l1)
   added: (in p9 t0)
   goals met: 4 of 12
21. (unload p4 t0 l1)
   deleted: (in p4 t0)
   added: (at p4 l1)
   goals met: 5 of 12
22. (drive t0 l1 l2 level74 level5 level79)
   deleted: (at t0 l1) (fuel t0 level79)
   added: (at t0 l2) (fuel t0 level74)
   goals met: 5 of 12
23. (unload p10 t0 l2)
   deleted: (in p10 t0)
   added: (at p10 l2)
   goals met: 6 of 12
24. (unload p11 t0 l2)
   deleted: (in p11 t0)
   added: (at p11 l2)
   goals met: 7 of 12
25. (unload p7 t0 l2)
   deleted: (in p7 t0)
   added: (at p7 l2)
   goals met: 8 of 12
26. (drive t0 l2 l0 level56 level18 level74)
   deleted: (at t0 l2) (fuel t0 level74)
   added: (at t0 l0) (fuel t0 level56)
   goals met: 8 of 12
27. (unload p1 t0 l0)
   deleted: (in p1 t0)
   added: (at p1 l0)
   goals met: 9 of 12
28. (unload p9 t0 l0)
   deleted: (in p9 t0)
   added: (at p9 l0)
   goals met: 10 of 12
29. (drive t0 l0 l3 level33 level23 level56)
   deleted: (at t0 l0) (fuel t0 level56)
   added: (at t0 l3) (fuel t0 level33)
   goals met: 10 of 12
30. (unload p2 t0 l3)
   deleted: (in p2 t0)
   added: (at p2 l3)
   goals met: 11 of 12
31. (unload p5 t0 l3)
   deleted: (in p5 t0)
   added: (at p5 l3)
   goals met: 12 of 12
